Atualização da documentação para tornar mais explicativa e didática
